Continued apply output from previous comment.
<details><summary>Show Output</summary>

```diff
ations" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "project_job"
      + id               = (known after apply)
      + name             = "sbeacon-dataportal-clinical-annotations"
      + range_key        = "annotation_name"
      + read_capacity    = (known after apply)
      + region           = "ap-southeast-3"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
          + "backup"      = "true"
        }
      + tags_all         = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
          + "backup"      = "true"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "annotation_name"
          + type = "S"
        }
      + attribute {
          + name = "project_job"
          + type = "S"
        }

      + global_table_witness (known after apply)

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)

      + warm_throughput (known after apply)
    }

  # module.sbeacon.aws_dynamodb_table.clinical_variants will be created
  + resource "aws_dynamodb_table" "clinical_variants" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "project_job"
      + id               = (known after apply)
      + name             = "sbeacon-dataportal-clinical-variants"
      + range_key        = "collection_name"
      + read_capacity    = (known after apply)
      + region           = "ap-southeast-3"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
          + "backup"      = "true"
        }
      + tags_all         = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
          + "backup"      = "true"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "collection_name"
          + type = "S"
        }
      + attribute {
          + name = "project_job"
          + type = "S"
        }

      + global_table_witness (known after apply)

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)

      + warm_throughput (known after apply)
    }

  # module.sbeacon.aws_dynamodb_table.dataportal_cli_upload will be created
  + resource "aws_dynamodb_table" "dataportal_cli_upload" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "uid"
      + id               = (known after apply)
      + name             = "sbeacon-dataportal-cli-upload"
      + range_key        = "upload_id"
      + read_capacity    = (known after apply)
      + region           = "ap-southeast-3"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
          + "backup"      = "true"
        }
      + tags_all         = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
          + "backup"      = "true"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "project_name"
          + type = "S"
        }
      + attribute {
          + name = "uid"
          + type = "S"
        }
      + attribute {
          + name = "upload_id"
          + type = "S"
        }

      + global_secondary_index {
          + hash_key           = "project_name"
          + name               = "cli-uploads-project-name-index"
          + non_key_attributes = []
          + projection_type    = "ALL"
          + range_key          = "uid"
          + read_capacity      = (known after apply)
          + write_capacity     = (known after apply)

          + warm_throughput (known after apply)
        }

      + global_table_witness (known after apply)

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl {
          + attribute_name = "ExpirationTime"
          + enabled        = true
        }

      + warm_throughput (known after apply)
    }

  # module.sbeacon.aws_dynamodb_table.dataportal_locks_table will be created
  + resource "aws_dynamodb_table" "dataportal_locks_table" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "LockId"
      + id               = (known after apply)
      + name             = "sbeacon-dataportal-mutex-locks"
      + read_capacity    = (known after apply)
      + region           = "ap-southeast-3"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
          + "backup"      = "true"
        }
      + tags_all         = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
          + "backup"      = "true"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "LockId"
          + type = "S"
        }

      + global_table_witness (known after apply)

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl {
          + attribute_name = "ExpirationTime"
          + enabled        = true
        }

      + warm_throughput (known after apply)
    }

  # module.sbeacon.aws_dynamodb_table.dataportal_pricing_cache will be created
  + resource "aws_dynamodb_table" "dataportal_pricing_cache" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "resource"
      + id               = (known after apply)
      + name             = "sbeacon-dataportal-pricing-cache"
      + read_capacity    = (known after apply)
      + region           = "ap-southeast-3"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
          + "backup"      = "true"
        }
      + tags_all         = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
          + "backup"      = "true"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "resource"
          + type = "S"
        }

      + global_table_witness (known after apply)

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl {
          + attribute_name = "ExpirationTime"
          + enabled        = true
        }

      + warm_throughput (known after apply)
    }

  # module.sbeacon.aws_dynamodb_table.descendant_terms will be created
  + resource "aws_dynamodb_table" "descendant_terms" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "term"
      + id               = (known after apply)
      + name             = "sbeacon-Descendants"
      + read_capacity    = (known after apply)
      + region           = "ap-southeast-3"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
          + "backup"      = "true"
        }
      + tags_all         = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
          + "backup"      = "true"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "term"
          + type = "S"
        }

      + global_table_witness (known after apply)

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)

      + warm_throughput (known after apply)
    }

  # module.sbeacon.aws_dynamodb_table.juptyer_notebooks will be created
  + resource "aws_dynamodb_table" "juptyer_notebooks" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "uid"
      + id               = (known after apply)
      + name             = "sbeacon-dataportal-juptyer-notebooks"
      + range_key        = "instanceName"
      + read_capacity    = (known after apply)
      + region           = "ap-southeast-3"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
          + "backup"      = "true"
        }
      + tags_all         = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
          + "backup"      = "true"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "instanceName"
          + type = "S"
        }
      + attribute {
          + name = "uid"
          + type = "S"
        }

      + global_table_witness (known after apply)

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)

      + warm_throughput (known after apply)
    }

  # module.sbeacon.aws_dynamodb_table.ontologies will be created
  + resource "aws_dynamodb_table" "ontologies" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "id"
      + id               = (known after apply)
      + name             = "sbeacon-Ontologies"
      + read_capacity    = (known after apply)
      + region           = "ap-southeast-3"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
          + "backup"      = "true"
        }
      + tags_all         = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
          + "backup"      = "true"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "id"
          + type = "S"
        }

      + global_table_witness (known after apply)

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)

      + warm_throughput (known after apply)
    }

  # module.sbeacon.aws_dynamodb_table.project_users will be created
  + resource "aws_dynamodb_table" "project_users" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "name"
      + id               = (known after apply)
      + name             = "sbeacon-dataportal-project-users"
      + range_key        = "uid"
      + read_capacity    = (known after apply)
      + region           = "ap-southeast-3"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
          + "backup"      = "true"
        }
      + tags_all         = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
          + "backup"      = "true"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "name"
          + type = "S"
        }
      + attribute {
          + name = "uid"
          + type = "S"
        }

      + global_secondary_index {
          + hash_key           = "uid"
          + name               = "uid-index"
          + non_key_attributes = []
          + projection_type    = "KEYS_ONLY"
          + range_key          = "name"
          + read_capacity      = (known after apply)
          + write_capacity     = (known after apply)

          + warm_throughput (known after apply)
        }

      + global_table_witness (known after apply)

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)

      + warm_throughput (known after apply)
    }

  # module.sbeacon.aws_dynamodb_table.projects will be created
  + resource "aws_dynamodb_table" "projects" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "name"
      + id               = (known after apply)
      + name             = "sbeacon-dataportal-projects"
      + read_capacity    = (known after apply)
      + region           = "ap-southeast-3"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
          + "backup"      = "true"
        }
      + tags_all         = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
          + "backup"      = "true"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "name"
          + type = "S"
        }

      + global_table_witness (known after apply)

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)

      + warm_throughput (known after apply)
    }

  # module.sbeacon.aws_dynamodb_table.saved_queries will be created
  + resource "aws_dynamodb_table" "saved_queries" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "uid"
      + id               = (known after apply)
      + name             = "sbeacon-dataportal-saved-queries"
      + range_key        = "name"
      + read_capacity    = (known after apply)
      + region           = "ap-southeast-3"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
          + "backup"      = "true"
        }
      + tags_all         = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
          + "backup"      = "true"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "name"
          + type = "S"
        }
      + attribute {
          + name = "uid"
          + type = "S"
        }

      + global_table_witness (known after apply)

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)

      + warm_throughput (known after apply)
    }

  # module.sbeacon.aws_dynamodb_table.sbeacon-dataportal-users-quota will be created
  + resource "aws_dynamodb_table" "sbeacon-dataportal-users-quota" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "uid"
      + id               = (known after apply)
      + name             = "sbeacon-dataportal-users-quota"
      + read_capacity    = (known after apply)
      + region           = "ap-southeast-3"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "Name"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
          + "backup"      = "true"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "NAME"        = "sbeacon-backend"
          + "Name"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
          + "backup"      = "true"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "uid"
          + type = "S"
        }

      + global_table_witness (known after apply)

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)

      + warm_throughput (known after apply)
    }

  # module.sbeacon.aws_dynamodb_table.sbeacon_dataportal_users_info will be created
  + resource "aws_dynamodb_table" "sbeacon_dataportal_users_info" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "uid"
      + id               = (known after apply)
      + name             = "sbeacon-dataportal-users-info"
      + read_capacity    = (known after apply)
      + region           = "ap-southeast-3"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
          + "backup"      = "true"
        }
      + tags_all         = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
          + "backup"      = "true"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "uid"
          + type = "S"
        }

      + global_table_witness (known after apply)

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)

      + warm_throughput (known after apply)
    }

  # module.sbeacon.aws_dynamodb_table.vcfs will be created
  + resource "aws_dynamodb_table" "vcfs" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "vcfLocation"
      + id               = (known after apply)
      + name             = "sbeacon-vcfs"
      + read_capacity    = (known after apply)
      + region           = "ap-southeast-3"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
          + "backup"      = "true"
        }
      + tags_all         = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
          + "backup"      = "true"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "vcfLocation"
          + type = "S"
        }

      + global_table_witness (known after apply)

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)

      + warm_throughput (known after apply)
    }

  # module.sbeacon.aws_glue_catalog_database.metadata-database will be created
  + resource "aws_glue_catalog_database" "metadata-database" {
      + arn          = (known after apply)
      + catalog_id   = (known after apply)
      + id           = (known after apply)
      + location_uri = (known after apply)
      + name         = "sbeacon_metadata"
      + region       = "ap-southeast-3"
      + tags_all     = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }

      + create_table_default_permission (known after apply)
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-analyses will be created
  + resource "aws_glue_catalog_table" "sbeacon-analyses" {
      + arn           = (known after apply)
      + catalog_id    = (known after apply)
      + database_name = "sbeacon_metadata"
      + id            = (known after apply)
      + name          = "sbeacon_analyses"
      + parameters    = {
          + "EXTERNAL"     = "TRUE"
          + "orc.compress" = "SNAPPY"
        }
      + region        = "ap-southeast-3"
      + table_type    = "EXTERNAL_TABLE"

      + partition_index (known after apply)

      + storage_descriptor {
          + input_format  = "org.apache.hadoop.hive.ql.io.orc.OrcInputFormat"
          + location      = "s3://gaspi-metadata-20250725085316769800000002/analyses"
          + output_format = "org.apache.hadoop.hive.ql.io.orc.OrcOutputFormat"

          + columns {
              + name = "id"
              + type = "string"
            }
          + columns {
              + name = "_datasetid"
              + type = "string"
            }
          + columns {
              + name = "_projectname"
              + type = "string"
            }
          + columns {
              + name = "_vcfsampleid"
              + type = "string"
            }
          + columns {
              + name = "individualid"
              + type = "string"
            }
          + columns {
              + name = "biosampleid"
              + type = "string"
            }
          + columns {
              + name = "runid"
              + type = "string"
            }
          + columns {
              + name = "aligner"
              + type = "string"
            }
          + columns {
              + name = "analysisdate"
              + type = "string"
            }
          + columns {
              + name = "info"
              + type = "string"
            }
          + columns {
              + name = "pipelinename"
              + type = "string"
            }
          + columns {
              + name = "pipelineref"
              + type = "string"
            }
          + columns {
              + name = "variantcaller"
              + type = "string"
            }

          + ser_de_info {
              + name                  = "ORC"
              + parameters            = {
                  + "hive.orc.use-column-names" = "TRUE"
                  + "orc.column.index.access"   = "FALSE"
                  + "serialization.format"      = "1"
                }
              + serialization_library = "org.apache.hadoop.hive.ql.io.orc.OrcSerde"
            }
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-analyses-cache will be created
  + resource "aws_glue_catalog_table" "sbeacon-analyses-cache" {
      + arn           = (known after apply)
      + catalog_id    = (known after apply)
      + database_name = "sbeacon_metadata"
      + id            = (known after apply)
      + name          = "sbeacon_analyses_cache"
      + parameters    = {
          + "EXTERNAL"     = "TRUE"
          + "orc.compress" = "SNAPPY"
        }
      + region        = "ap-southeast-3"
      + table_type    = "EXTERNAL_TABLE"

      + partition_index (known after apply)

      + storage_descriptor {
          + input_format  = "org.apache.hadoop.hive.ql.io.orc.OrcInputFormat"
          + location      = "s3://gaspi-metadata-20250725085316769800000002/analyses-cache"
          + output_format = "org.apache.hadoop.hive.ql.io.orc.OrcOutputFormat"

          + columns {
              + name = "id"
              + type = "string"
            }
          + columns {
              + name = "_datasetid"
              + type = "string"
            }
          + columns {
              + name = "_projectname"
              + type = "string"
            }
          + columns {
              + name = "_vcfsampleid"
              + type = "string"
            }
          + columns {
              + name = "individualid"
              + type = "string"
            }
          + columns {
              + name = "biosampleid"
              + type = "string"
            }
          + columns {
              + name = "runid"
              + type = "string"
            }
          + columns {
              + name = "aligner"
              + type = "string"
            }
          + columns {
              + name = "analysisdate"
              + type = "string"
            }
          + columns {
              + name = "info"
              + type = "string"
            }
          + columns {
              + name = "pipelinename"
              + type = "string"
            }
          + columns {
              + name = "pipelineref"
              + type = "string"
            }
          + columns {
              + name = "variantcaller"
              + type = "string"
            }

          + ser_de_info {
              + name                  = "ORC"
              + parameters            = {
                  + "hive.orc.use-column-names" = "TRUE"
                  + "orc.column.index.access"   = "FALSE"
                  + "serialization.format"      = "1"
                }
              + serialization_library = "org.apache.hadoop.hive.ql.io.orc.OrcSerde"
            }
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-biosamples will be created
  + resource "aws_glue_catalog_table" "sbeacon-biosamples" {
      + arn           = (known after apply)
      + catalog_id    = (known after apply)
      + database_name = "sbeacon_metadata"
      + id            = (known after apply)
      + name          = "sbeacon_biosamples"
      + parameters    = {
          + "EXTERNAL"     = "TRUE"
          + "orc.compress" = "SNAPPY"
        }
      + region        = "ap-southeast-3"
      + table_type    = "EXTERNAL_TABLE"

      + partition_index (known after apply)

      + storage_descriptor {
          + input_format  = "org.apache.hadoop.hive.ql.io.orc.OrcInputFormat"
          + location      = "s3://gaspi-metadata-20250725085316769800000002/biosamples"
          + output_format = "org.apache.hadoop.hive.ql.io.orc.OrcOutputFormat"

          + columns {
              + name = "id"
              + type = "string"
            }
          + columns {
              + name = "_datasetid"
              + type = "string"
            }
          + columns {
              + name = "_projectname"
              + type = "string"
            }
          + columns {
              + name = "individualid"
              + type = "string"
            }
          + columns {
              + name = "biosamplestatus"
              + type = "string"
            }
          + columns {
              + name = "collectiondate"
              + type = "string"
            }
          + columns {
              + name = "collectionmoment"
              + type = "string"
            }
          + columns {
              + name = "diagnosticmarkers"
              + type = "string"
            }
          + columns {
              + name = "histologicaldiagnosis"
              + type = "string"
            }
          + columns {
              + name = "measurements"
              + type = "string"
            }
          + columns {
              + name = "obtentionprocedure"
              + type = "string"
            }
          + columns {
              + name = "pathologicalstage"
              + type = "string"
            }
          + columns {
              + name = "pathologicaltnmfinding"
              + type = "string"
            }
          + columns {
              + name = "phenotypicfeatures"
              + type = "string"
            }
          + columns {
              + name = "sampleorigindetail"
              + type = "string"
            }
          + columns {
              + name = "sampleorigintype"
              + type = "string"
            }
          + columns {
              + name = "sampleprocessing"
              + type = "string"
            }
          + columns {
              + name = "samplestorage"
              + type = "string"
            }
          + columns {
              + name = "tumorgrade"
              + type = "string"
            }
          + columns {
              + name = "tumorprogression"
              + type = "string"
            }
          + columns {
              + name = "info"
              + type = "string"
            }
          + columns {
              + name = "notes"
              + type = "string"
            }

          + ser_de_info {
              + name                  = "ORC"
              + parameters            = {
                  + "hive.orc.use-column-names" = "TRUE"
                  + "orc.column.index.access"   = "FALSE"
                  + "serialization.format"      = "1"
                }
              + serialization_library = "org.apache.hadoop.hive.ql.io.orc.OrcSerde"
            }
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-biosamples-cache will be created
  + resource "aws_glue_catalog_table" "sbeacon-biosamples-cache" {
      + arn           = (known after apply)
      + catalog_id    = (known after apply)
      + database_name = "sbeacon_metadata"
      + id            = (known after apply)
      + name          = "sbeacon_biosamples_cache"
      + parameters    = {
          + "EXTERNAL"     = "TRUE"
          + "orc.compress" = "SNAPPY"
        }
      + region        = "ap-southeast-3"
      + table_type    = "EXTERNAL_TABLE"

      + partition_index (known after apply)

      + storage_descriptor {
          + input_format  = "org.apache.hadoop.hive.ql.io.orc.OrcInputFormat"
          + location      = "s3://gaspi-metadata-20250725085316769800000002/biosamples-cache"
          + output_format = "org.apache.hadoop.hive.ql.io.orc.OrcOutputFormat"

          + columns {
              + name = "id"
              + type = "string"
            }
          + columns {
              + name = "_datasetid"
              + type = "string"
            }
          + columns {
              + name = "_projectname"
              + type = "string"
            }
          + columns {
              + name = "individualid"
              + type = "string"
            }
          + columns {
              + name = "biosamplestatus"
              + type = "string"
            }
          + columns {
              + name = "collectiondate"
              + type = "string"
            }
          + columns {
              + name = "collectionmoment"
              + type = "string"
            }
          + columns {
              + name = "diagnosticmarkers"
              + type = "string"
            }
          + columns {
              + name = "histologicaldiagnosis"
              + type = "string"
            }
          + columns {
              + name = "measurements"
              + type = "string"
            }
          + columns {
              + name = "obtentionprocedure"
              + type = "string"
            }
          + columns {
              + name = "pathologicalstage"
              + type = "string"
            }
          + columns {
              + name = "pathologicaltnmfinding"
              + type = "string"
            }
          + columns {
              + name = "phenotypicfeatures"
              + type = "string"
            }
          + columns {
              + name = "sampleorigindetail"
              + type = "string"
            }
          + columns {
              + name = "sampleorigintype"
              + type = "string"
            }
          + columns {
              + name = "sampleprocessing"
              + type = "string"
            }
          + columns {
              + name = "samplestorage"
              + type = "string"
            }
          + columns {
              + name = "tumorgrade"
              + type = "string"
            }
          + columns {
              + name = "tumorprogression"
              + type = "string"
            }
          + columns {
              + name = "info"
              + type = "string"
            }
          + columns {
              + name = "notes"
              + type = "string"
            }

          + ser_de_info {
              + name                  = "ORC"
              + parameters            = {
                  + "hive.orc.use-column-names" = "TRUE"
                  + "orc.column.index.access"   = "FALSE"
                  + "serialization.format"      = "1"
                }
              + serialization_library = "org.apache.hadoop.hive.ql.io.orc.OrcSerde"
            }
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-datasets will be created
  + resource "aws_glue_catalog_table" "sbeacon-datasets" {
      + arn           = (known after apply)
      + catalog_id    = (known after apply)
      + database_name = "sbeacon_metadata"
      + id            = (known after apply)
      + name          = "sbeacon_datasets"
      + parameters    = {
          + "EXTERNAL"     = "TRUE"
          + "orc.compress" = "SNAPPY"
        }
      + region        = "ap-southeast-3"
      + table_type    = "EXTERNAL_TABLE"

      + partition_index (known after apply)

      + storage_descriptor {
          + input_format  = "org.apache.hadoop.hive.ql.io.orc.OrcInputFormat"
          + location      = "s3://gaspi-metadata-20250725085316769800000002/datasets"
          + output_format = "org.apache.hadoop.hive.ql.io.orc.OrcOutputFormat"

          + columns {
              + name = "id"
              + type = "string"
            }
          + columns {
              + name = "_assemblyid"
              + type = "string"
            }
          + columns {
              + name = "_projectname"
              + type = "string"
            }
          + columns {
              + name = "_datasetname"
              + type = "string"
            }
          + columns {
              + name = "_vcflocations"
              + type = "string"
            }
          + columns {
              + name = "_vcfchromosomemap"
              + type = "string"
            }
          + columns {
              + name = "createdatetime"
              + type = "string"
            }
          + columns {
              + name = "datauseconditions"
              + type = "string"
            }
          + columns {
              + name = "description"
              + type = "string"
            }
          + columns {
              + name = "externalurl"
              + type = "string"
            }
          + columns {
              + name = "info"
              + type = "string"
            }
          + columns {
              + name = "name"
              + type = "string"
            }
          + columns {
              + name = "updatedatetime"
              + type = "string"
            }
          + columns {
              + name = "version"
              + type = "string"
            }

          + ser_de_info {
              + name                  = "ORC"
              + parameters            = {
                  + "hive.orc.use-column-names" = "TRUE"
                  + "orc.column.index.access"   = "FALSE"
                  + "serialization.format"      = "1"
                }
              + serialization_library = "org.apache.hadoop.hive.ql.io.orc.OrcSerde"
            }
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-datasets-cache will be created
  + resource "aws_glue_catalog_table" "sbeacon-datasets-cache" {
      + arn           = (known after apply)
      + catalog_id    = (known after apply)
      + database_name = "sbeacon_metadata"
      + id            = (known after apply)
      + name          = "sbeacon_datasets_cache"
      + parameters    = {
          + "EXTERNAL"     = "TRUE"
          + "orc.compress" = "SNAPPY"
        }
      + region        = "ap-southeast-3"
      + table_type    = "EXTERNAL_TABLE"

      + partition_index (known after apply)

      + storage_descriptor {
          + input_format  = "org.apache.hadoop.hive.ql.io.orc.OrcInputFormat"
          + location      = "s3://gaspi-metadata-20250725085316769800000002/datasets-cache"
          + output_format = "org.apache.hadoop.hive.ql.io.orc.OrcOutputFormat"

          + columns {
              + name = "id"
              + type = "string"
            }
          + columns {
              + name = "_assemblyid"
              + type = "string"
            }
          + columns {
              + name = "_projectname"
              + type = "string"
            }
          + columns {
              + name = "_datasetname"
              + type = "string"
            }
          + columns {
              + name = "_vcflocations"
              + type = "string"
            }
          + columns {
              + name = "_vcfchromosomemap"
              + type = "string"
            }
          + columns {
              + name = "createdatetime"
              + type = "string"
            }
          + columns {
              + name = "datauseconditions"
              + type = "string"
            }
          + columns {
              + name = "description"
              + type = "string"
            }
          + columns {
              + name = "externalurl"
              + type = "string"
            }
          + columns {
              + name = "info"
              + type = "string"
            }
          + columns {
              + name = "name"
              + type = "string"
            }
          + columns {
              + name = "updatedatetime"
              + type = "string"
            }
          + columns {
              + name = "version"
              + type = "string"
            }

          + ser_de_info {
              + name                  = "ORC"
              + parameters            = {
                  + "hive.orc.use-column-names" = "TRUE"
                  + "orc.column.index.access"   = "FALSE"
                  + "serialization.format"      = "1"
                }
              + serialization_library = "org.apache.hadoop.hive.ql.io.orc.OrcSerde"
            }
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-individuals will be created
  + resource "aws_glue_catalog_table" "sbeacon-individuals" {
      + arn           = (known after apply)
      + catalog_id    = (known after apply)
      + database_name = "sbeacon_metadata"
      + id            = (known after apply)
      + name          = "sbeacon_individuals"
      + parameters    = {
          + "EXTERNAL"     = "TRUE"
          + "orc.compress" = "SNAPPY"
        }
      + region        = "ap-southeast-3"
      + table_type    = "EXTERNAL_TABLE"

      + partition_index (known after apply)

      + storage_descriptor {
          + input_format  = "org.apache.hadoop.hive.ql.io.orc.OrcInputFormat"
          + location      = "s3://gaspi-metadata-20250725085316769800000002/individuals"
          + output_format = "org.apache.hadoop.hive.ql.io.orc.OrcOutputFormat"

          + columns {
              + name = "id"
              + type = "string"
            }
          + columns {
              + name = "_datasetid"
              + type = "string"
            }
          + columns {
              + name = "_projectname"
              + type = "string"
            }
          + columns {
              + name = "diseases"
              + type = "string"
            }
          + columns {
              + name = "ethnicity"
              + type = "string"
            }
          + columns {
              + name = "exposures"
              + type = "string"
            }
          + columns {
              + name = "geographicorigin"
              + type = "string"
            }
          + columns {
              + name = "info"
              + type = "string"
            }
          + columns {
              + name = "interventionsorprocedures"
              + type = "string"
            }
          + columns {
              + name = "karyotypicsex"
              + type = "string"
            }
          + columns {
              + name = "measures"
              + type = "string"
            }
          + columns {
              + name = "pedigrees"
              + type = "string"
            }
          + columns {
              + name = "phenotypicfeatures"
              + type = "string"
            }
          + columns {
              + name = "sex"
              + type = "string"
            }
          + columns {
              + name = "treatments"
              + type = "string"
            }

          + ser_de_info {
              + name                  = "ORC"
              + parameters            = {
                  + "hive.orc.use-column-names" = "TRUE"
                  + "orc.column.index.access"   = "FALSE"
                  + "serialization.format"      = "1"
                }
              + serialization_library = "org.apache.hadoop.hive.ql.io.orc.OrcSerde"
            }
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-individuals-cache will be created
  + resource "aws_glue_catalog_table" "sbeacon-individuals-cache" {
      + arn           = (known after apply)
      + catalog_id    = (known after apply)
      + database_name = "sbeacon_metadata"
      + id            = (known after apply)
      + name          = "sbeacon_individuals_cache"
      + parameters    = {
          + "EXTERNAL"     = "TRUE"
          + "orc.compress" = "SNAPPY"
        }
      + region        = "ap-southeast-3"
      + table_type    = "EXTERNAL_TABLE"

      + partition_index (known after apply)

      + storage_descriptor {
          + input_format  = "org.apache.hadoop.hive.ql.io.orc.OrcInputFormat"
          + location      = "s3://gaspi-metadata-20250725085316769800000002/individuals-cache"
          + output_format = "org.apache.hadoop.hive.ql.io.orc.OrcOutputFormat"

          + columns {
              + name = "id"
              + type = "string"
            }
          + columns {
              + name = "_datasetid"
              + type = "string"
            }
          + columns {
              + name = "_projectname"
              + type = "string"
            }
          + columns {
              + name = "diseases"
              + type = "string"
            }
          + columns {
              + name = "ethnicity"
              + type = "string"
            }
          + columns {
              + name = "exposures"
              + type = "string"
            }
          + columns {
              + name = "geographicorigin"
              + type = "string"
            }
          + columns {
              + name = "info"
              + type = "string"
            }
          + columns {
              + name = "interventionsorprocedures"
              + type = "string"
            }
          + columns {
              + name = "karyotypicsex"
              + type = "string"
            }
          + columns {
              + name = "measures"
              + type = "string"
            }
          + columns {
              + name = "pedigrees"
              + type = "string"
            }
          + columns {
              + name = "phenotypicfeatures"
              + type = "string"
            }
          + columns {
              + name = "sex"
              + type = "string"
            }
          + columns {
              + name = "treatments"
              + type = "string"
            }

          + ser_de_info {
              + name                  = "ORC"
              + parameters            = {
                  + "hive.orc.use-column-names" = "TRUE"
                  + "orc.column.index.access"   = "FALSE"
                  + "serialization.format"      = "1"
                }
              + serialization_library = "org.apache.hadoop.hive.ql.io.orc.OrcSerde"
            }
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-relations will be created
  + resource "aws_glue_catalog_table" "sbeacon-relations" {
      + arn           = (known after apply)
      + catalog_id    = (known after apply)
      + database_name = "sbeacon_metadata"
      + id            = (known after apply)
      + name          = "sbeacon_relations"
      + parameters    = {
          + "EXTERNAL"     = "TRUE"
          + "orc.compress" = "SNAPPY"
        }
      + region        = "ap-southeast-3"
      + table_type    = "EXTERNAL_TABLE"

      + partition_index (known after apply)

      + storage_descriptor {
          + input_format  = "org.apache.hadoop.hive.ql.io.orc.OrcInputFormat"
          + location      = "s3://gaspi-metadata-20250725085316769800000002/relations"
          + output_format = "org.apache.hadoop.hive.ql.io.orc.OrcOutputFormat"

          + columns {
              + name = "datasetid"
              + type = "string"
            }
          + columns {
              + name = "individualid"
              + type = "string"
            }
          + columns {
              + name = "biosampleid"
              + type = "string"
            }
          + columns {
              + name = "runid"
              + type = "string"
            }
          + columns {
              + name = "analysisid"
              + type = "string"
            }

          + ser_de_info {
              + name                  = "ORC"
              + parameters            = {
                  + "hive.orc.use-column-names" = "TRUE"
                  + "orc.column.index.access"   = "FALSE"
                  + "serialization.format"      = "1"
                }
              + serialization_library = "org.apache.hadoop.hive.ql.io.orc.OrcSerde"
            }
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-runs will be created
  + resource "aws_glue_catalog_table" "sbeacon-runs" {
      + arn           = (known after apply)
      + catalog_id    = (known after apply)
      + database_name = "sbeacon_metadata"
      + id            = (known after apply)
      + name          = "sbeacon_runs"
      + parameters    = {
          + "EXTERNAL"     = "TRUE"
          + "orc.compress" = "SNAPPY"
        }
      + region        = "ap-southeast-3"
      + table_type    = "EXTERNAL_TABLE"

      + partition_index (known after apply)

      + storage_descriptor {
          + input_format  = "org.apache.hadoop.hive.ql.io.orc.OrcInputFormat"
          + location      = "s3://gaspi-metadata-20250725085316769800000002/runs"
          + output_format = "org.apache.hadoop.hive.ql.io.orc.OrcOutputFormat"

          + columns {
              + name = "id"
              + type = "string"
            }
          + columns {
              + name = "_datasetid"
              + type = "string"
            }
          + columns {
              + name = "_projectname"
              + type = "string"
            }
          + columns {
              + name = "biosampleid"
              + type = "string"
            }
          + columns {
              + name = "individualid"
              + type = "string"
            }
          + columns {
              + name = "info"
              + type = "string"
            }
          + columns {
              + name = "librarylayout"
              + type = "string"
            }
          + columns {
              + name = "libraryselection"
              + type = "string"
            }
          + columns {
              + name = "librarysource"
              + type = "string"
            }
          + columns {
              + name = "librarystrategy"
              + type = "string"
            }
          + columns {
              + name = "platform"
              + type = "string"
            }
          + columns {
              + name = "platformmodel"
              + type = "string"
            }
          + columns {
              + name = "rundate"
              + type = "string"
            }

          + ser_de_info {
              + name                  = "ORC"
              + parameters            = {
                  + "hive.orc.use-column-names" = "TRUE"
                  + "orc.column.index.access"   = "FALSE"
                  + "serialization.format"      = "1"
                }
              + serialization_library = "org.apache.hadoop.hive.ql.io.orc.OrcSerde"
            }
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-runs-cache will be created
  + resource "aws_glue_catalog_table" "sbeacon-runs-cache" {
      + arn           = (known after apply)
      + catalog_id    = (known after apply)
      + database_name = "sbeacon_metadata"
      + id            = (known after apply)
      + name          = "sbeacon_runs_cache"
      + parameters    = {
          + "EXTERNAL"     = "TRUE"
          + "orc.compress" = "SNAPPY"
        }
      + region        = "ap-southeast-3"
      + table_type    = "EXTERNAL_TABLE"

      + partition_index (known after apply)

      + storage_descriptor {
          + input_format  = "org.apache.hadoop.hive.ql.io.orc.OrcInputFormat"
          + location      = "s3://gaspi-metadata-20250725085316769800000002/runs-cache"
          + output_format = "org.apache.hadoop.hive.ql.io.orc.OrcOutputFormat"

          + columns {
              + name = "id"
              + type = "string"
            }
          + columns {
              + name = "_datasetid"
              + type = "string"
            }
          + columns {
              + name = "_projectname"
              + type = "string"
            }
          + columns {
              + name = "biosampleid"
              + type = "string"
            }
          + columns {
              + name = "individualid"
              + type = "string"
            }
          + columns {
              + name = "info"
              + type = "string"
            }
          + columns {
              + name = "librarylayout"
              + type = "string"
            }
          + columns {
              + name = "libraryselection"
              + type = "string"
            }
          + columns {
              + name = "librarysource"
              + type = "string"
            }
          + columns {
              + name = "librarystrategy"
              + type = "string"
            }
          + columns {
              + name = "platform"
              + type = "string"
            }
          + columns {
              + name = "platformmodel"
              + type = "string"
            }
          + columns {
              + name = "rundate"
              + type = "string"
            }

          + ser_de_info {
              + name                  = "ORC"
              + parameters            = {
                  + "hive.orc.use-column-names" = "TRUE"
                  + "orc.column.index.access"   = "FALSE"
                  + "serialization.format"      = "1"
                }
              + serialization_library = "org.apache.hadoop.hive.ql.io.orc.OrcSerde"
            }
        }
    }

  # module.sbeacon.aws_glue_catalog_table.sbeacon-terms-cache will be created
  + resource "aws_glue_catalog_table" "sbeacon-terms-cache" {
      + arn           = (known after apply)
      + catalog_id    = (known after apply)
      + database_name = "sbeacon_metadata"
      + id            = (known after apply)
      + name          = "sbeacon_terms_cache"
      + parameters    = {
          + "EXTERNAL"     = "TRUE"
          + "orc.compress" = "SNAPPY"
        }
      + region        = "ap-southeast-3"
      + table_type    = "EXTERNAL_TABLE"

      + partition_index (known after apply)

      + storage_descriptor {
          + input_format  = "org.apache.hadoop.hive.ql.io.orc.OrcInputFormat"
          + location      = "s3://gaspi-metadata-20250725085316769800000002/terms-cache"
          + output_format = "org.apache.hadoop.hive.ql.io.orc.OrcOutputFormat"

          + columns {
              + name = "kind"
              + type = "string"
            }
          + columns {
              + name = "id"
              + type = "string"
            }
          + columns {
              + name = "term"
              + type = "string"
            }
          + columns {
              + name = "label"
              + type = "string"
            }
          + columns {
              + name = "type"
              + type = "string"
            }
          + columns {
              + name = "_projectname"
              + type = "string"
            }

          + ser_de_info {
              + name                  = "ORC"
              + parameters            = {
                  + "hive.orc.use-column-names" = "TRUE"
                  + "orc.column.index.access"   = "FALSE"
                  + "serialization.format"      = "1"
                }
              + serialization_library = "org.apache.hadoop.hive.ql.io.orc.OrcSerde"
            }
        }
    }

  # module.sbeacon.aws_glue_crawler.sbeacon-crawler will be created
  + resource "aws_glue_crawler" "sbeacon-crawler" {
      + arn           = (known after apply)
      + configuration = jsonencode(
            {
              + CrawlerOutput = {
                  + Partitions = {
                      + AddOrUpdateBehavior = "InheritFromTable"
                    }
                }
              + Grouping      = {
                  + TableGroupingPolicy = "CombineCompatibleSchemas"
                }
              + Version       = 1
            }
        )
      + database_name = "sbeacon_metadata"
      + id            = (known after apply)
      + name          = "sbeacon-crawler"
      + region        = "ap-southeast-3"
      + role          = (known after apply)
      + tags_all      = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }

      + catalog_target {
          + database_name = "sbeacon_metadata"
          + tables        = [
              + "sbeacon_individuals",
              + "sbeacon_biosamples",
            ]
        }

      + schema_change_policy {
          + delete_behavior = "LOG"
          + update_behavior = "UPDATE_IN_DATABASE"
        }
    }

  # module.sbeacon.aws_iam_instance_profile.ec2_deidentification_instance_profile will be created
  + resource "aws_iam_instance_profile" "ec2_deidentification_instance_profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "sbeacon_backend_ec2_deidentification_instance_profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "sbeacon_backend_ec2_deidentification_instance_role"
      + tags_all    = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
      + unique_id   = (known after apply)
    }

  # module.sbeacon.aws_iam_policy.extra-glue-policy will be created
  + resource "aws_iam_policy" "extra-glue-policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Extra permissions"
      + id               = (known after apply)
      + name             = "extra-glue-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:ListBucket",
                          + "s3:ListAllMyBuckets",
                          + "s3:GetObject",
                          + "s3:GetBucketLocation",
                          + "s3:GetBucketAcl",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::gaspi-metadata-20250725085316769800000002/*",
                          + "arn:aws:s3:::gaspi-metadata-20250725085316769800000002",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
    }

  # module.sbeacon.aws_iam_policy.sagemaker_jupyter_instance_policy will be created
  + resource "aws_iam_policy" "sagemaker_jupyter_instance_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy for Sagemaker Jupyter instance to access GASPI-ETL notebooks and gaspifs binary"
      + id               = (known after apply)
      + name             = "sagemaker_jupyter_instance_policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
    }

  # module.sbeacon.aws_iam_role.ec2_deidentification_instance_role will be created
  + resource "aws_iam_role" "ec2_deidentification_instance_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "sbeacon_backend_ec2_deidentification_instance_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.sbeacon.aws_iam_role.glue_role will be created
  + resource "aws_iam_role" "glue_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "glue.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "glue_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.sbeacon.aws_iam_role.sagemaker_jupyter_instance_role will be created
  + resource "aws_iam_role" "sagemaker_jupyter_instance_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "sagemaker.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "sbeacon_backend_sagemaker_jupyter_instance_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "STAGING"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "GXC"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.sbeacon.aws_iam_role_policy.ec2_deidentification_policy will be created
  + resource "aws_iam_role_policy" "ec2_deidentification_policy" {
      + id          = (known after apply)
      + name        = "sbeacon_backend_ec2_deidentification_policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # module.sbeacon.aws_iam_role_policy_attachment.glue-extra-policy-attachment will be created
  + resource "aws_iam_role_policy_attachment" "glue-extra-policy-attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "glue_role"
    }

  # module.sbeacon.aws_iam_role_policy_attachment.glue-service-role-attachment will be created
  + resource "aws_iam_role_policy_attachment" "glue-service-role-attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSGlueServiceRole"
      + role       = "glue_role"
    }

  # module.sbeacon.aws_iam_role_policy_attachment.sagemaker_jupyter_instance_role_attachment will be created
  + resource "aws_iam_role_policy_attachment" "sagemaker_jupyter_instance_role_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "sbeacon_backend_sagemaker_jupyter_instance_role"
    }

  # module.sbeacon.aws_lambda_layer_version.binaries_layer will be created
  + resource "aws_lambda_layer_version" "binaries_layer" {
      + arn                         = (known after apply)
      + code_sha256                 = (known after apply)
      + compatible_runtimes         = [
          + "python3.12",
        ]
      + created_date                = (known after apply)
      + filename                    = "sbeacon/binaries.zip"
      + id                          = (known after apply)
      + layer_arn                   = (known after apply)
      + layer_name                  = "sbeacon_backend_binaries_layer"
      + region                      = "ap-southeast-3"
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + skip_destroy                = false
      + source_code_hash            = (known after apply)
      + source_code_size            = (known after apply)
      + version                     = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIGetConfiguration will be created
  + resource "aws_lambda_permission" "APIGetConfiguration" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sbeacon-backend-getConfiguration"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIGetConfigurationInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.sbeacon.aws_lambda_permission.APIGetEntryTypes will be created
  + resource "aws_lambda_permission" "APIGetEntryTypes" 
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.